tests/fixtures/xml/fake_ConsultarInformacoesMovimento.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:sped = "http://sped.fazenda.gov.br/" ><soapenv:Header/><soapenv:Body><sped:ConsultarInformacoesMovimento><sped:cnpj>999999999999999</sped:cnpj><sped:situacaoInformacao>0</sped:situacaoInformacao><sped:anoMesInicioVigencia>2017/01</sped:anoMesInicioVigencia><sped:anoMesTerminoVigencia>2017/12</sped:anoMesTerminoVigencia><sped:tipoMovimento>1</sped:tipoMovimento><sped:tipoIdentificacao>1</sped:tipoIdentificacao><sped:identificacao>12345678901</sped:identificacao></sped:ConsultarInformacoesMovimento></soapenv:Body></soapenv:Envelope>