tests/fixtures/xml/fake_ConsultarInformacoesPatrocinado.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:sped = "http://sped.fazenda.gov.br/" ><soapenv:Header/><soapenv:Body><sped:ConsultarInformacoesPatrocinado><sped:cnpj>999999999999999</sped:cnpj><sped:GINN>12ASDA.12345.LE.123</sped:GINN><sped:NumeroIdentificacao>12345678901234</sped:NumeroIdentificacao></sped:ConsultarInformacoesPatrocinado></soapenv:Body></soapenv:Envelope>