tests/fixtures/xml/fake_ConsultarInformacoesIntermediario.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:sped = "http://sped.fazenda.gov.br/" ><soapenv:Header/><soapenv:Body><sped:ConsultarInformacoesIntermediario><sped:cnpj>999999999999999</sped:cnpj><sped:TipoNI>1</sped:TipoNI><sped:NumeroIdentificacao>12345678901</sped:NumeroIdentificacao></sped:ConsultarInformacoesIntermediario></soapenv:Body></soapenv:Envelope>