tests/fixtures/xml/fake_ConsultarListaEFinanceira.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:sped = "http://sped.fazenda.gov.br/" ><soapenv:Header/><soapenv:Body><sped:ConsultarListaEFinanceira><sped:cnpj>999999999999999</sped:cnpj><sped:situacaoEFinanceira>1</sped:situacaoEFinanceira><sped:dataInicio>2017-01-12</sped:dataInicio><sped:dataFim>2017-06-01</sped:dataFim></sped:ConsultarListaEFinanceira></soapenv:Body></soapenv:Envelope>